apache/nuttx/arch/arm/src/imxrt/imxrt_edma.c
  /* Push tcd into hardware TCD register */

  /* Clear DONE bit first, otherwise ESG cannot be set */

  putreg16(0,             base + IMXRT_EDMA_TCD_CSR_OFFSET);

  putreg32(tcd->saddr,    base + IMXRT_EDMA_TCD_SADDR_OFFSET);
  putreg16(tcd->soff,     base + IMXRT_EDMA_TCD_SOFF_OFFSET);
  putreg16(tcd->attr,     base + IMXRT_EDMA_TCD_ATTR_OFFSET);
  putreg32(tcd->nbytes,   base + IMXRT_EDMA_TCD_NBYTES_ML_OFFSET);
  putreg32(tcd->slast,    base + IMXRT_EDMA_TCD_SLAST_OFFSET);
  putreg32(tcd->daddr,    base + IMXRT_EDMA_TCD_DADDR_OFFSET);
  putreg16(tcd->doff,     base + IMXRT_EDMA_TCD_DOFF_OFFSET);
  putreg16(tcd->citer,    base + IMXRT_EDMA_TCD_CITER_ELINK_OFFSET);
  putreg32(tcd->dlastsga, base + IMXRT_EDMA_TCD_DLASTSGA_OFFSET);

  putreg16(tcd->csr,      base + IMXRT_EDMA_TCD_CSR_OFFSET);

  putreg16(tcd->biter,    base + IMXRT_EDMA_TCD_BITER_ELINK_OFFSET);
}
#endif

/****************************************************************************
 * Name: imxrt_dmaterminate
 *
 * Description:
 *   Terminate the DMA transfer and disable the DMA channel
 *
 ****************************************************************************/

static void imxrt_dmaterminate(struct imxrt_dmach_s *dmach, int result)
{
#if CONFIG_IMXRT_EDMA_NTCD > 0
  struct imxrt_edmatcd_s *tcd;
  struct imxrt_edmatcd_s *next;
#endif
  uintptr_t regaddr;
  uint8_t regval8;
  uint8_t chan;
  edma_callback_t callback;
  irqstate_t flags;
  void *arg;

  flags = spin_lock_irqsave(&g_edma.lock);

  /* Disable channel ERROR interrupts */

  chan            = dmach->chan;
  regval8         = EDMA_CEEI(chan);
  putreg8(regval8, IMXRT_EDMA_CEEI);

  /* Disable channel IRQ requests */

  regval8         = EDMA_CERQ(chan);
  putreg8(regval8, IMXRT_EDMA_CERQ);

  regaddr         = IMXRT_EDMA_TCD_CSR(chan);
  putreg16(0, regaddr);

  /* Cancel next TCD transfer. */

  regaddr         = IMXRT_EDMA_TCD_DLASTSGA(chan);
  putreg32(0, regaddr);

#if CONFIG_IMXRT_EDMA_NTCD > 0
  /* Return all allocated TCDs to the free list */

  for (tcd = dmach->head; tcd != NULL; tcd = next)
    {
      /* If channel looped to itself we are done
       * if not continue to free tcds in chain
       */

       next = dmach->flags & EDMA_CONFIG_LOOPDEST ?
              NULL : (struct imxrt_edmatcd_s *)tcd->dlastsga;

       imxrt_tcd_free_nolock(tcd);
    }

  dmach->head = NULL;
  dmach->tail = NULL;
#endif

  /* Perform the DMA complete callback */

  callback = dmach->callback;
  arg      = dmach->arg;

  dmach->callback = NULL;
  dmach->arg      = NULL;
  dmach->state    = IMXRT_DMA_IDLE;

  if (callback)
    {
      callback((DMACH_HANDLE)dmach, arg, true, result);
    }

  spin_unlock_irqrestore(&g_edma.lock, flags);
}

/****************************************************************************
 * Name: imxrt_dmach_interrupt
 *
 * Description:
 *   DMA interrupt handler.  This function clears the channel major
 *   interrupt flag and calls the callback function if it is not NULL.
 *
 *   NOTE:  For the case using TCD queue, when the major iteration count is
 *   exhausted, additional operations are performed.  These include the
 *   final address adjustments and reloading of the BITER field into the
 *   CITER.  Assertion of an optional interrupt request also occurs at this
 *   time, as does a possible fetch of a new TCD from memory using the
 *   scatter/gather address pointer included in the descriptor (if scatter/
 *   gather is enabled).
 *
 ****************************************************************************/

static int imxrt_dmach_interrupt(struct imxrt_dmach_s *dmach)
{
  uintptr_t regaddr;
  uint32_t  regval32;
  uint16_t  regval16;
  uint8_t   regval8;
  uint8_t   chan;
  int       result;

  /* Check for an eDMA pending interrupt on this channel */

  chan     = dmach->chan;

  regval32 = getreg32(IMXRT_EDMA_INT);

  if ((regval32 & EDMA_INT(chan)) != 0)
    {
      /* An interrupt is pending.  This should only happen if the channel is
       * active.
       */

      DEBUGASSERT(dmach->state == IMXRT_DMA_ACTIVE);

      /* Clear the pending eDMA channel interrupt */

      regval8 = EDMA_CINT(chan);
      putreg8(regval8, IMXRT_EDMA_CINT);

      /* Get the eDMA TCD Control and Status register value. */

      regaddr  = IMXRT_EDMA_TCD_CSR(chan);
      regval16 = getreg16(regaddr);

      /* Check if transfer has finished. */

      if ((regval16 & EDMA_TCD_CSR_DONE) != 0)
        {
          /* Clear the pending DONE interrupt status. */

          regval8 = EDMA_CDNE(chan);
          putreg8(regval8, IMXRT_EDMA_CDNE);
          result = OK;
        }
      else
        {
#if CONFIG_IMXRT_EDMA_NTCD > 0
          /* Perform the half or end-of-major-cycle DMA callback */

          if (dmach->callback != NULL)
            {
              dmach->callback((DMACH_HANDLE)dmach, dmach->arg,
                              false, OK);
            }

          return OK;
#else
          /* Otherwise the interrupt was not expected! */

          DEBUGPANIC();
          result = -EPIPE;
#endif
        }

      /* Terminate the transfer when it is done. */

      if ((dmach->flags & EDMA_CONFIG_LOOP_MASK) == 0)
        {
          imxrt_dmaterminate(dmach, result);
        }
      else if (dmach->callback != NULL)
        {
          dmach->callback((DMACH_HANDLE)dmach, dmach->arg,
                          true, result);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: imxrt_edma_interrupt
 *
 * Description:
 *  DMA interrupt handler
 *
 ****************************************************************************/

static int imxrt_edma_interrupt(int irq, void *context, void *arg)
{
  struct imxrt_dmach_s *dmach;
  unsigned int chan;

  /* 'arg' should the DMA channel instance.
   *
   * NOTE that there are only 16 vectors for 32 DMA channels.  The 'arg' will
   * always be the lower-numbered DMA channel.  The other DMA channel will
   * have a channel number 16 greater that this one.
   */

  dmach = (struct imxrt_dmach_s *)arg;
  DEBUGASSERT(dmach != NULL);
  chan  = dmach->chan;
  DEBUGASSERT(chan < IMXRT_EDMA_NCHANNELS && dmach == &g_edma.dmach[chan]);

  /* Check for an interrupt on the lower numbered DMA channel */

  imxrt_dmach_interrupt(dmach);

  /* Check for an interrupt on the higher numbered DMA channel */

  chan += 16;
  DEBUGASSERT(chan < IMXRT_EDMA_NCHANNELS);
  dmach = &g_edma.dmach[chan];
  imxrt_dmach_interrupt(dmach);

  return OK;
}

/****************************************************************************
 * Name: imxrt_error_interrupt
 *
 * Description:
 *  DMA error interrupt handler
 *
 ****************************************************************************/

